var models = {
    host: {
        obj: "./obj/host.obj",
        mtl: "./obj/host.mtl",
        mesh: null
    },
    router: {
        obj: "./obj/router.obj",
        mtl: "./obj/router.mtl",
        mesh: null
    },
    detection: {
        obj: "./obj/detection.obj",
        mtl: "./obj/detection.mtl",
        mesh: null
    },
    switch: {
        obj: "./obj/switch.obj",
        mtl: "./obj/switch.mtl",
        mesh: null
    },
    firewall: {
        obj: "./obj/firewall.obj",
        mtl: "./obj/firewall.mtl",
        mesh: null
    },
    server: {
        obj: "./obj/server.obj",
        mtl: "./obj/server.mtl",
        mesh: null
    },
};
let nexus = {
    nodes:[],
    links:[]
}

let routerArr = []
let switchArr = [];
let switchHeight = 60;
function getPosition(arr) {
    //get all x or y or Z 
    let xArr = arr.map(x => x.x)
    let yArr = arr.map(x => x.y)
    let zArr = arr.map(x => x.z)
    let maxX = Math.max.apply(null, xArr)
    let minX = Math.min.apply(null, xArr)
    let maxY = Math.max.apply(null, yArr)
    let minY = Math.min.apply(null, yArr)
    let maxZ = Math.max.apply(null, zArr)
    let minZ = Math.min.apply(null, zArr)
    return {
        x: (maxX + minX) / 2,
        z: (maxZ + minZ) / 2,
        y: (maxY + minY) / 2,
    }
}

function getSwitchPosition(arr,id=0,ip="",name) {
    let obj = getPosition(arr)
    obj.y = obj.y + switchHeight
    if(ip){
        obj.ip=ip
    }
    if(name){
        obj.name=name
    }
    obj.id=id
    return obj
}
/* 
|             3 | 10.101.10.0/24 | 10.101.10.50  |
|             3 | 10.101.10.0/24 | 10.101.10.99  |
|             3 | 10.101.10.0/24 | 10.101.10.75  |
|             3 | 10.101.10.0/24 | 10.101.10.17  |
|             3 | 10.101.10.0/24 | 10.101.10.98  |
|             3 | 10.101.10.0/24 | 10.101.10.135 |
|             3 | 10.101.10.0/24 | 10.101.10.68  |
|             3 | 10.101.10.0/24 | 10.101.10.200 |
|             3 | 10.101.10.0/24 | 10.101.10.100 |
|             3 | 10.101.10.0/24 | 10.101.10.93  |
|             3 | 10.101.10.0/24 | 10.101.10.174 |
|             3 | 10.101.10.0/24 | 10.101.10.106 |
|             3 | 10.101.10.0/24 | 10.101.10.29  |
|             3 | 10.101.10.0/24 | 10.101.10.64  |
*/
const dep1 = [
    {x: -100, y: 5, z: -100 , id : 1,ip:"10.101.10.50"},
    {x: -120, y: 5, z: -100 , id : 2,ip:"10.101.10.99"},
    {x: -140, y: 5, z: -100 , id : 3,ip:"10.101.10.75"}, 
    {x: -160, y: 5, z: -100 , id : 4,ip:"10.101.10.17"}, 
    {x: -180, y: 5, z: -100 , id : 5,ip:"10.101.10.98"},
    {x: -100, y: 5, z: -130 , id : 6,ip:"10.101.10.135"},
    {x: -120, y: 5, z: -130 , id : 7,ip:"10.101.10.68"},
    {x: -140, y: 5, z: -130 , id : 8,ip:"10.101.10.200"}, 
    {x: -160, y: 5, z: -130 , id : 9,ip:"10.101.10.100"}, 
    {x: -180, y: 5, z: -130 , id : 10,ip:"10.101.10.93"},  
    {x: -180, y: 5, z: -70 , id : 11,ip:"10.101.10.174"},  
    {x: -120, y: 5, z: -70 , id : 12,ip:"10.101.10.106"},  
    {x: -140, y: 5, z: -70 , id : 13,ip:"10.101.10.29"},  
    {x: -160, y: 5, z: -70 , id : 14,ip:"10.101.10.64"},  
]
dep1.forEach(x=>{
    x.dep="dep1",
    nexus.links.push({
        target:x.id,
        source:108
    })
})
/* 
|             4 | 10.101.11.0/24 | 10.101.11.159 |
|             4 | 10.101.11.0/24 | 10.101.11.45  |
|             4 | 10.101.11.0/24 | 10.101.11.56  |
|             4 | 10.101.11.0/24 | 10.101.11.76  |
|             4 | 10.101.11.0/24 | 10.101.11.23  |
|             4 | 10.101.11.0/24 | 10.101.11.221 |
|             4 | 10.101.11.0/24 | 10.101.11.32  |
|             4 | 10.101.11.0/24 | 10.101.11.209 |
|             4 | 10.101.11.0/24 | 10.101.11.93  |
|             4 | 10.101.11.0/24 | 10.101.11.211 |

*/
const dep2 = [
    { x: 40, y: 5, z: -100 , id : 15,ip:"10.101.11.159"},
    { x: 20, y: 5, z: -100 , id : 16,ip:"10.101.11.45"},
    { x: 0, y: 5, z: -100 , id : 17,ip:"10.101.11.56"}, 
    { x: -20, y: 5, z: -100 , id : 18,ip:"10.101.11.76"}, 
    { x: -40, y: 5, z: -100 , id : 19,ip:"10.101.11.23"}, 
    { x: 40, y: 5, z: -130 , id : 20,ip:"10.101.11.221"},
    { x: 20, y: 5, z: -130 , id : 21,ip:"10.101.11.32"},
    { x: 0, y: 5, z: -130 , id : 22,ip:"10.101.11.209"}, 
    { x: -20, y: 5, z: -130 , id : 23,ip:"10.101.11.93"}, 
    { x: -40, y: 5, z: -130 , id : 24,ip:"10.101.11.211"}, 
   /*  { x: -40, y: 5, z: -70 , id : 21},
    { x: -20, y: 5, z: -70 , id : 22},
    { x: 0, y: 5, z: -70 , id : 23}, 
    { x: 20, y: 5, z: -70 , id : 24},  */
]
dep2.forEach(x=>{
    x.dep="dep2"
    nexus.links.push({
        target:x.id,
        source:109
    })
})
/* 
|             5 | 10.101.12.0/24 | 10.101.12.229 |
|             5 | 10.101.12.0/24 | 10.101.12.64  |
|             5 | 10.101.12.0/24 | 10.101.12.156 |
|             5 | 10.101.12.0/24 | 10.101.12.43  |
|             5 | 10.101.12.0/24 | 10.101.12.245 |
|             5 | 10.101.12.0/24 | 10.101.12.145 |
|             5 | 10.101.12.0/24 | 10.101.12.179 |
|             5 | 10.101.12.0/24 | 10.101.12.29  |
|             5 | 10.101.12.0/24 | 10.101.12.51  |
|             5 | 10.101.12.0/24 | 10.101.12.30  |
|             5 | 10.101.12.0/24 | 10.101.12.132 |
|             5 | 10.101.12.0/24 | 10.101.12.185 |
*/
const dep3 = [
    { x: -180, y: 5, z: -20 , id : 25,ip:"10.101.12.229"},
    { x: -160, y: 5, z: -20 , id : 26,ip:"10.101.12.64"},
    { x: -140, y: 5, z: -20 , id : 27,ip:"10.101.12.156"},
    { x: -120, y: 5, z: -20 , id : 28,ip:"10.101.12.43"}, 
    { x: -180, y: 5, z: 10 , id : 29,ip:"10.101.12.245"},
    { x: -160, y: 5, z: 10 , id : 30,ip:"10.101.12.145"},
    { x: -140, y: 5, z: 10 , id : 31,ip:"10.101.12.179"},
    { x: -120, y: 5, z: 10 , id : 32,ip:"10.101.12.29"}, 
    { x: -180, y: 5, z: 40 , id : 33,ip:"10.101.12.51"},
    { x: -160, y: 5, z: 40 , id : 34,ip:"10.101.12.30"},
    { x: -140, y: 5, z: 40 , id : 35,ip:"10.101.12.132"},
    { x: -120, y: 5, z: 40 , id : 36,ip:"10.101.12.185"}, 
]
dep3.forEach(x=>{
    x.dep="dep3"
    nexus.links.push({
        target:x.id,
        source:110
    })
})
/* 
|             6 | 10.101.13.0/24 | 10.101.13.23  |
|             6 | 10.101.13.0/24 | 10.101.13.157 |
|             6 | 10.101.13.0/24 | 10.101.13.53  |
|             6 | 10.101.13.0/24 | 10.101.13.97  |
|             6 | 10.101.13.0/24 | 10.101.13.168 |
|             6 | 10.101.13.0/24 | 10.101.13.125 |
|             6 | 10.101.13.0/24 | 10.101.13.77  |
|             6 | 10.101.13.0/24 | 10.101.13.217 |
|             6 | 10.101.13.0/24 | 10.101.13.93  |
|             6 | 10.101.13.0/24 | 10.101.13.249 |
|             6 | 10.101.13.0/24 | 10.101.13.50  |
|             6 | 10.101.13.0/24 | 10.101.13.74  |
|             6 | 10.101.13.0/24 | 10.101.13.124 |
|             6 | 10.101.13.0/24 | 10.101.13.126 |
|             6 | 10.101.13.0/24 | 10.101.13.116 |
*/
const dep4 = [
    { x: -180, y: 5, z: 90 , id : 37,ip:"10.101.13.23"},
    { x: -160, y: 5, z: 90 , id : 38,ip:"10.101.13.157"},
    { x: -140, y: 5, z: 90 , id : 39,ip:"10.101.13.53"},
    { x: -120, y: 5, z: 90 , id : 40,ip:"10.101.13.97"},  
    { x: -100, y: 5, z: 90 , id : 41,ip:"10.101.13.168"},  
    { x: -180, y: 5, z: 120 , id : 42,ip:"10.101.13.125"},
    { x: -160, y: 5, z: 120 , id : 43,ip:"10.101.13.77"},
    { x: -140, y: 5, z: 120 , id : 44,ip:"10.101.13.217"},
    { x: -120, y: 5, z: 120 , id : 45,ip:"10.101.13.93"},  
    { x: -100, y: 5, z: 120 , id : 46,ip:"10.101.13.249"},  
    { x: -180, y: 5, z: 150 , id : 47,ip:"10.101.13.50"},
    { x: -160, y: 5, z: 150 , id : 48,ip:"10.101.13.74"},
    { x: -140, y: 5, z: 150 , id : 49,ip:"10.101.13.124"},
    { x: -120, y: 5, z: 150 , id : 50,ip:"10.101.13.126"},  
    { x: -100, y: 5, z: 150 , id : 51,ip:"10.101.13.116"},  
]
dep4.forEach(x=>{
    x.dep="dep4"
    nexus.links.push({
        target:x.id,
        source:111
    })
})
/* 
|             7 | 10.101.20.0/24 | 10.101.20.112 |
|             7 | 10.101.20.0/24 | 10.101.20.167 |
|             7 | 10.101.20.0/24 | 10.101.20.143 |
|             7 | 10.101.20.0/24 | 10.101.20.137 |
|             7 | 10.101.20.0/24 | 10.101.20.122 |
|             7 | 10.101.20.0/24 | 10.101.20.203 |
|             7 | 10.101.20.0/24 | 10.101.20.118 |
|             7 | 10.101.20.0/24 | 10.101.20.26  |
|             7 | 10.101.20.0/24 | 10.101.20.205 |
|             7 | 10.101.20.0/24 | 10.101.20.169 |
|             7 | 10.101.20.0/24 | 10.101.20.104 |
|             7 | 10.101.20.0/24 | 10.101.20.161 |
|             7 | 10.101.20.0/24 | 10.101.20.35  |
|             7 | 10.101.20.0/24 | 10.101.20.89  |
|             7 | 10.101.20.0/24 | 10.101.20.130 |
*/
const tdep1 = [
    { x: 40, y: 5, z: 90 , id : 52,ip:"10.101.20.112"},
    { x: 20, y: 5, z: 90 , id : 53,ip:"10.101.20.167"},
    { x: 0, y: 5, z: 90 , id : 54,ip:"10.101.20.143"},
    { x: -20, y: 5, z: 90 , id : 55,ip:"10.101.20.137"},  
    { x: -40, y: 5, z: 90 , id : 56,ip:"10.101.20.122"},  
    { x: 40, y: 5, z: 120 , id : 57,ip:"10.101.20.203"},
    { x: 20, y: 5, z: 120 , id : 58,ip:"10.101.20.118"},
    { x: 0, y: 5, z: 120 , id : 59,ip:"10.101.20.26"},
    { x: -20, y: 5, z: 120 , id : 60,ip:"10.101.20.205"},  
    { x: -40, y: 5, z: 120 , id : 61,ip:"10.101.20.169"},  
    { x: 40, y: 5, z: 150 , id : 62,ip:"10.101.20.104"},
    { x: 20, y: 5, z: 150 , id : 63,ip:"10.101.20.161"},
    { x: 0, y: 5, z: 150 , id : 64,ip:"10.101.20.35"},
    { x: -20, y: 5, z: 150 , id : 65,ip:"10.101.20.89"},  
    { x: -40, y: 5, z: 150 , id : 66,ip:"10.101.20.130"},  
]
tdep1.forEach(x=>{
    x.dep="tdep1"
    nexus.links.push({
        target:x.id,
        source:112
    })
})
/* 
|             8 | 10.101.21.0/24 | 10.101.21.89  |
|             8 | 10.101.21.0/24 | 10.101.21.201 |
|             8 | 10.101.21.0/24 | 10.101.21.161 |
|             8 | 10.101.21.0/24 | 10.101.21.85  |
|             8 | 10.101.21.0/24 | 10.101.21.159 |
|             8 | 10.101.21.0/24 | 10.101.21.128 |
|             8 | 10.101.21.0/24 | 10.101.21.56  |
|             8 | 10.101.21.0/24 | 10.101.21.102 |
|             8 | 10.101.21.0/24 | 10.101.21.176 |
|             8 | 10.101.21.0/24 | 10.101.21.147 |
|             8 | 10.101.21.0/24 | 10.101.21.226 |
|             8 | 10.101.21.0/24 | 10.101.21.81  |
|             8 | 10.101.21.0/24 | 10.101.21.217 |
|             8 | 10.101.21.0/24 | 10.101.21.69  |
|             8 | 10.101.21.0/24 | 10.101.21.169 |
|             8 | 10.101.21.0/24 | 10.101.21.206 |
*/
const tdep2 = [
    { x: 100, y: 5, z: 90 , id : 67,ip:"10.101.21.89"},
    { x: 120, y: 5, z: 90 , id : 68,ip:"10.101.21.201"},
    { x: 140, y: 5, z: 90 , id : 69,ip:"10.101.21.161"},
    { x: 160, y: 5, z: 90 , id : 70,ip:"10.101.21.85"},  
    { x: 180, y: 5, z: 90 , id : 71,ip:"10.101.21.159"},  
    { x: 200, y: 5, z: 90 , id : 72,ip:"10.101.21.128"},   
    { x: 100, y: 5, z: 120 , id : 73,ip:"10.101.21.56"},
    { x: 120, y: 5, z: 120 , id : 74,ip:"10.101.21.102"},
    { x: 140, y: 5, z: 120 , id : 75,ip:"10.101.21.176"},
    { x: 160, y: 5, z: 120 , id : 76,ip:"10.101.21.147"},  
    { x: 180, y: 5, z: 120 , id : 77,ip:"10.101.21.226"},  
    { x: 200, y: 5, z: 120 , id : 78,ip:"10.101.21.81"},   
    { x: 100, y: 5, z: 150 , id : 79,ip:"10.101.21.217"},
    { x: 120, y: 5, z: 150 , id : 80,ip:"10.101.21.69"},
    { x: 140, y: 5, z: 150 , id : 81,ip:"10.101.21.169"},
    { x: 160, y: 5, z: 150 , id :82,ip:"10.101.21.206"},    
]
tdep2.forEach(x=>{
    x.dep="tdep2"
    nexus.links.push({
        target:x.id,
        source:113
    })
})
/* 
|            10 | 10.101.81.0/24 | 10.101.81.204 |
|            10 | 10.101.81.0/24 | 10.101.81.180 |
|            10 | 10.101.81.0/24 | 10.101.81.33  |
|            10 | 10.101.81.0/24 | 10.101.81.53  |
|            10 | 10.101.81.0/24 | 10.101.81.220 |
*/
const ddep = [
    { x: 240, y: 5, z: 90 , id :83,ip:"10.101.81.204"}, 
    { x: 270, y: 5, z: 90 , id :84,ip:"10.101.21.180"}, 
    { x: 300, y: 5, z: 90 , id :85,ip:"10.101.21.33"}, 
    { x: 240, y: 5, z: 120 , id :86,ip:"10.101.21.53"}, 
    { x: 270, y: 5, z: 120 , id :87,ip:"10.101.21.220"},  
]
ddep.forEach(x=>{
    x.dep="ddep"
    nexus.links.push({
        target:x.id,
        source:114
    })
})
/* 
|             9 | 10.101.80.0/24 | 10.101.80.12  |
|             9 | 10.101.80.0/24 | 10.101.80.66  |
|             9 | 10.101.80.0/24 | 10.101.80.224 |
|             9 | 10.101.80.0/24 | 10.101.80.22  |
|             9 | 10.101.80.0/24 | 10.101.80.236 |
|             9 | 10.101.80.0/24 | 10.101.80.173 |
*/
const gdep = [
    { x: 240, y: 5, z:40 , id :88,ip:"10.101.80.12"}, 
    { x: 270, y: 5, z: 40 , id :89,ip:"10.101.80.66"}, 
    { x: 300, y: 5, z:40, id :90,ip:"10.101.80.224"}, 
    { x: 240, y: 5, z: 10 ,id :91,ip:"10.101.80.22"}, 
    { x: 270, y: 5, z: 10 ,id :92,ip:"10.101.80.236"},  
    { x: 300, y: 5, z: 10,id :93,ip:"10.101.80.173"},  
]
gdep.forEach(x=>{
    x.dep="gdep"
    nexus.links.push({
        target:x.id,
        source:115
    })
})

 
const ndep = [
    { x: 240, y: 5, z:-40 ,id :94,ip:"10.101.0.16"}, 
    { x: 270, y: 5, z: -40 ,id :95,ip:"10.101.0.113"}, 
    { x: 300, y: 5, z:-40 ,id :96,ip:"10.101.0.180"},    
]
ndep.forEach(x=>{
    x.dep="ndep"
    nexus.links.push({
        target:x.id,
        source:116
    })
})

let tdep = [
    ...tdep1,
    ...tdep2,
]
let allNodes = [
    ...dep1,
    ...dep2,
    ...dep3,
    ...dep4,
    ...tdep,
    ...ddep, 
    ...gdep, 
    ...ndep, 
]

allNodes.forEach(x=>{
    x.type=1;
    x.typeName="host";
})
/* 
|             2 | 10.101.1.0/24  | 10.101.1.249  |
|             2 | 10.101.1.0/24  | 10.101.1.239  |
|             2 | 10.101.1.0/24  | 10.101.1.124  |
|             2 | 10.101.1.0/24  | 10.101.1.136  |
|             2 | 10.101.1.0/24  | 10.101.1.63   |
|             2 | 10.101.1.0/24  | 10.101.1.57   |
|             2 | 10.101.1.0/24  | 10.101.1.58   |
|             2 | 10.101.1.0/24  | 10.101.1.81   |
|             2 | 10.101.1.0/24  | 10.101.1.46   |
|             2 | 10.101.1.0/24  | 10.101.1.113  |
|             2 | 10.101.1.0/24  | 10.101.1.217  |

*/
let serverCenter = [
    { x: 300, y: 5, z:-100 ,id :97,ip:"10.101.1.249"}, 
    { x: 280, y: 5, z:-90 ,id :98,ip:"10.101.1.239"}, 
    { x: 260, y: 5, z:-100 ,id :99,ip:"10.101.1.124"}, 
    { x: 240, y: 5, z:-90 ,id :100,ip:"10.101.1.136"}, 
    { x: 220, y: 5, z:-100 ,id :101,ip:"10.101.1.63"}, 
    { x: 200, y: 5, z:-90 ,id :102,ip:"10.101.1.57"}, 
    { x: 180, y: 5, z:-100 ,id :103,ip:"10.101.1.58"}, 
    { x: 160, y: 5, z:-90 ,id :104,ip:"10.101.1.81"}, 
    { x: 140, y: 5, z:-100 ,id :105,ip:"10.101.1.46"}, 
    { x: 120, y: 5, z:-90 ,id :106,ip:"10.101.1.113"}, 
    { x: 100, y: 5, z:-100 ,id :107,ip:"10.101.1.217"}
]
 
serverCenter.forEach(x=>{
    x.type=2;
    x.typeName="server";
    x.dep="serverCenter"
    nexus.links.push({
        target:x.id,
        source:117
    })
})
switchArr.push( 
    getSwitchPosition(dep1,108,"10.101.10.0/24","R&D Dept.1"),
    getSwitchPosition(dep2,109,"10.101.11.0/24","R&D Dept.2"),
    getSwitchPosition(dep3,110,"10.101.12.0/24","R&D Dept.3"),
    getSwitchPosition(dep4,111,"10.101.13.0/24","R&D Dept.4"),
    getSwitchPosition(tdep1,112,"10.101.20.0/24","Test Dept.1"),
    getSwitchPosition(tdep2,113,"10.101.21.0/24","Test Dept.2"),
    getSwitchPosition(ddep,114,"10.101.81.0/24","Design Dept."),
    getSwitchPosition(gdep,115,"10.101.80.0/24","General Dept."),
    getSwitchPosition(ndep,116,"10.101.0.0/24","Network Center"),
    getSwitchPosition(serverCenter,117,"10.101.1.0/24","Data Center"),
 ) 
//研发部
let devDep = {
    x:getSwitchPosition(dep3).x+80,
    y:getSwitchPosition(dep3).y+45,
    z:getSwitchPosition(dep3).z,
    id:118
}
//四个研发部连接
nexus.links.push(
    { target:108, source:118 },
    { target:109, source:118 },
    { target:110, source:118 },
    { target:111, source:118 }
)
//测试部
let testDep = {
    x:getSwitchPosition(tdep).x,
    y:getSwitchPosition(tdep).y+45,
    z:getSwitchPosition(tdep).z-50,
    id:119
}
//测试
nexus.links.push(
    { target:112, source:119 },
    { target:113, source:119 } 
)
//设计综合
let uiDepA = [
    ...ddep, 
    ...gdep 
]
let uiDeps = {
    x:getSwitchPosition(uiDepA).x-70,
    y:getSwitchPosition(uiDepA).y+45,
    z:getSwitchPosition(uiDepA).z,
    id:120
}
nexus.links.push(
    { target:114, source:120 },
    { target:115, source:120 } 
)
//服务器
let centerDepArr = [
    ...ndep, 
    ...serverCenter 
]
let centerDep = {
    x:getSwitchPosition(centerDepArr).x,
    y:getSwitchPosition(centerDepArr).y+45,
    z:getSwitchPosition(centerDepArr).z+20,
    id:121
}
nexus.links.push(
    { target:116, source:121 }, //网管-交换机
    { target:125, source:121 },//防火墙-交换机
    { target:117, source:125 }, //数据中心-防火墙
    { target:121, source:123 }, //交换机-入侵检测
    { target:118, source:124 } ,
    { target:118, source:122 } 
)
//连接路由器
nexus.links.push(
    { target:124, source:126 } , 
    { target:119, source:126 } , 
    { target:120, source:126 } , 
    { target:121, source:126 } , 
    
)
switchArr.push(devDep,testDep,uiDeps,centerDep)

switchArr.forEach(x=>{
    x.type=3;
    x.typeName="switch";
})
//添加入侵检测
let detectionArr = []
let firewallArr = []
detectionArr.push({
    x:devDep.x,
    y:devDep.y,
    z:devDep.z+30,
    id:122
})
detectionArr.push({
    x:centerDep.x,
    y:centerDep.y,
    z:centerDep.z+30, 
    id:123
})
detectionArr.forEach(x=>{
    x.type=5;
    x.typeName="detection"; 
})
firewallArr.push({
    x:devDep.x+35,
    y:devDep.y+15,
    z:devDep.z,
    id:124
})
firewallArr.push({
    x:centerDep.x,
    y:centerDep.y-12,
    z:centerDep.z-25,
    id:125
})
firewallArr.forEach(x=>{
    x.type=6;
    x.typeName="firewall";
})

//所有
const list = [
    ...allNodes,
    ...serverCenter,
    ...switchArr,
    ...detectionArr,
    ...firewallArr
]
routerArr.push({
    ...getPosition(list), 
    y:160,
    type:4,
    typeName:"router",
    id:126
}) 
//添加路由器
list.push(...routerArr)  